--------------------------------------------------------------------------
-- 인게임에서 사용하는 상수 및 그외 UI에서 사용하는 상수 일괄
--------------------------------------------------------------------------


-- ## 게임에 참여하는 드래곤 수
PARTICIPATE_DRAGON_CNT = 5

-- ## 공용탄 미사일이 목표를 지나치고 난 후 사라지는 시간
MISSILE_FADE_OUT_TIME = 0.3

-- ## 공용탄 미사일 발사 주기, (발사 주기 / 미사일 발사 수 = 발사 간격)
FIRE_LIMIT_TIME = 0.5








--------------------------------------------
-- 각 스킬에서 공유하는 상수
--------------------------------------------

-- # 1. SkillLeafBlade
 LEAF_COLLISTION_SIZE = 30